# tkinterライブラリを使用 => tkで呼び出し可能
import tkinter as tk
# tkinter内のttk機能をインポート
from tkinter import ttk

# ###############################################
# メインウィンドウ生成
# ###############################################
# メインウィンドウオブジェクト作成
root = tk.Tk()
# ウィンドウサイズ指定(横:220 縦:180)
root.geometry('220x180')
# ウィンドウタイトル指定
root.title("年号換算")

# ###############################################
# フレーム生成
# ###############################################
# ウィジェット(部品)をまとめるフレームを作成
frame = ttk.Frame(root)
# フレームを画面上に配置
frame.pack()

# ###############################################
# ウィジェット生成
# > frameを親要素とする
# ###############################################
# ラベル生成
label = ttk.Label(frame, text='年を入力')
# 入力ボックス生成
ibox = ttk.Entry(frame, width=10, justify='right')
# ボタン生成
btn1 = ttk.Button(frame, text='換算')
# ボタン生成
# => root.destroy : ウィンドウ終了命令を設定
btn2 = ttk.Button(frame, text='終了', command=root.destroy)

# ###############################################
# ウィジェット配置
# > row : 行
# > column : 列
# > padx : 左右の空き具合
# > pady : 上下の空き具合
# ###############################################
# ラベル･入力ボックス･ボタンをgridで画面上に配置
label.grid(row=0, column=0, padx=5, pady=10)
ibox.grid(row=0, column=1, padx=2, pady=10)
btn1.grid(row=5, column=0, padx=5, pady=3)
btn2.grid(row=5, column=1, padx=2, pady=3)

# ###############################################
# 画面表示
# > 操作可能状態にする
# ###############################################
root.mainloop()
